{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/ryan/Google Drive/2020_2021/Thesis/Data/thesis/clean_data/2008.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Oct 2020, 02:24:22
{txt}
{com}. 
. * 2008 Democratic primaries (phone)
. 
. * Load in a STATA data set
. use df08phone_d
{txt}(Written by R.              )

{com}. 
. * Test
. clogit VoteCandidate CLINTON EDWARDS NORMALIZED_FT NORMALIZED_VIABILITY NORMALIZED_ELECTABILITY NORMALIZED_IDEOLOGY TRAITS, group(ID)
{txt}note: 36 groups (50 obs) dropped because of all positive or
      all negative outcomes.
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-1622.4261}  
Iteration 1:{space 3}log likelihood = {res:-1481.2536}  
Iteration 2:{space 3}log likelihood = {res:-1456.9991}  
Iteration 3:{space 3}log likelihood = {res:-1456.7867}  
Iteration 4:{space 3}log likelihood = {res:-1456.7866}  
{res}
{txt}Conditional (fixed-effects) logistic regression

{col 49}Number of obs{col 67}= {res}    10,775
{txt}{col 49}LR chi2({res}7{txt}){col 67}= {res}   4973.10
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1456.7866{txt}{col 49}Pseudo R2{col 67}= {res}    0.6306

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          VoteCandidate{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      z{col 57}   P>|z|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}CLINTON {c |}{col 25}{res}{space 2}-.0228999{col 37}{space 2} .0665636{col 48}{space 1}   -0.34{col 57}{space 3}0.731{col 65}{space 4}-.1533621{col 78}{space 3} .1075624
{txt}{space 16}EDWARDS {c |}{col 25}{res}{space 2}-.1629517{col 37}{space 2}  .083004{col 48}{space 1}   -1.96{col 57}{space 3}0.050{col 65}{space 4}-.3256366{col 78}{space 3}-.0002668
{txt}{space 10}NORMALIZED_FT {c |}{col 25}{res}{space 2}  2.20211{col 37}{space 2}  .098093{col 48}{space 1}   22.45{col 57}{space 3}0.000{col 65}{space 4} 2.009852{col 78}{space 3} 2.394369
{txt}{space 3}NORMALIZED_VIABILITY {c |}{col 25}{res}{space 2} 2.609313{col 37}{space 2} .3771453{col 48}{space 1}    6.92{col 57}{space 3}0.000{col 65}{space 4} 1.870121{col 78}{space 3} 3.348504
{txt}NORMALIZED_ELECTABILITY {c |}{col 25}{res}{space 2} 2.752842{col 37}{space 2} .3787244{col 48}{space 1}    7.27{col 57}{space 3}0.000{col 65}{space 4} 2.010556{col 78}{space 3} 3.495128
{txt}{space 4}NORMALIZED_IDEOLOGY {c |}{col 25}{res}{space 2}-.3428502{col 37}{space 2} .0787167{col 48}{space 1}   -4.36{col 57}{space 3}0.000{col 65}{space 4}-.4971321{col 78}{space 3}-.1885684
{txt}{space 17}TRAITS {c |}{col 25}{res}{space 2} 8.943046{col 37}{space 2} .4889372{col 48}{space 1}   18.29{col 57}{space 3}0.000{col 65}{space 4} 7.984747{col 78}{space 3} 9.901346
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. cd "/Users/ryan/Google Drive/2020_2021/Thesis/Data/stata_regressions/2008"
{res}/Users/ryan/Google Drive/2020_2021/Thesis/Data/stata_regressions/2008
{txt}
{com}. outreg2 using 2008_phone_d.xls, replace
{txt}{browse `"2008_phone_d.xls"'}
{browse `"/Users/ryan/Google Drive/2020_2021/Thesis/Data/stata_regressions/2008"' :dir}{com} : {txt}{stata `"seeout using "2008_phone_d.txt""':seeout}

{com}. 
. clogit VoteCandidate CLINTON EDWARDS NORMALIZED_FT NORMALIZED_VIABILITY NORMALIZED_ELECTABILITY NORMALIZED_IDEOLOGY, group(ID)
{txt}note: 36 groups (50 obs) dropped because of all positive or
      all negative outcomes.
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-1726.4354}  
Iteration 1:{space 3}log likelihood = {res:-1697.4304}  
Iteration 2:{space 3}log likelihood = {res:-1693.0631}  
Iteration 3:{space 3}log likelihood = {res:-1693.0609}  
Iteration 4:{space 3}log likelihood = {res:-1693.0609}  
{res}
{txt}Conditional (fixed-effects) logistic regression

{col 49}Number of obs{col 67}= {res}    10,775
{txt}{col 49}LR chi2({res}6{txt}){col 67}= {res}   4500.55
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1693.0609{txt}{col 49}Pseudo R2{col 67}= {res}    0.5707

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          VoteCandidate{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      z{col 57}   P>|z|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}CLINTON {c |}{col 25}{res}{space 2} .3491679{col 37}{space 2} .0589308{col 48}{space 1}    5.93{col 57}{space 3}0.000{col 65}{space 4} .2336656{col 78}{space 3} .4646703
{txt}{space 16}EDWARDS {c |}{col 25}{res}{space 2} .1229043{col 37}{space 2} .0764035{col 48}{space 1}    1.61{col 57}{space 3}0.108{col 65}{space 4}-.0268438{col 78}{space 3} .2726523
{txt}{space 10}NORMALIZED_FT {c |}{col 25}{res}{space 2} 3.174365{col 37}{space 2} .0912088{col 48}{space 1}   34.80{col 57}{space 3}0.000{col 65}{space 4} 2.995599{col 78}{space 3} 3.353131
{txt}{space 3}NORMALIZED_VIABILITY {c |}{col 25}{res}{space 2} 3.335901{col 37}{space 2} .3481888{col 48}{space 1}    9.58{col 57}{space 3}0.000{col 65}{space 4} 2.653463{col 78}{space 3} 4.018338
{txt}NORMALIZED_ELECTABILITY {c |}{col 25}{res}{space 2} 3.815621{col 37}{space 2} .3372203{col 48}{space 1}   11.31{col 57}{space 3}0.000{col 65}{space 4} 3.154681{col 78}{space 3}  4.47656
{txt}{space 4}NORMALIZED_IDEOLOGY {c |}{col 25}{res}{space 2}-.4155561{col 37}{space 2} .0725393{col 48}{space 1}   -5.73{col 57}{space 3}0.000{col 65}{space 4}-.5577306{col 78}{space 3}-.2733816
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. outreg2 using 2008_phone_d.xls
{txt}{browse `"2008_phone_d.xls"'}
{browse `"/Users/ryan/Google Drive/2020_2021/Thesis/Data/stata_regressions/2008"' :dir}{com} : {txt}{stata `"seeout using "2008_phone_d.txt""':seeout}

{com}. 
. 
. * 2008 Republican primaries (phone)
. 
. * Load in a STATA data set
. cd "/Users/ryan/Google Drive/2020_2021/Thesis/Data/thesis/clean_data"
{res}/Users/ryan/Google Drive/2020_2021/Thesis/Data/thesis/clean_data
{txt}
{com}. use df08phone_r
{txt}(Written by R.              )

{com}. 
. * Test
. clogit VoteCandidate ROMNEY HUCKABEE NORMALIZED_FT NORMALIZED_VIABILITY NORMALIZED_ELECTABILITY NORMALIZED_IDEOLOGY TRAITS, group(ID)
{txt}note: 31 groups (40 obs) dropped because of all positive or
      all negative outcomes.
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-1345.1828}  
Iteration 1:{space 3}log likelihood = {res:-1267.1898}  
Iteration 2:{space 3}log likelihood = {res:-1191.0372}  
Iteration 3:{space 3}log likelihood = {res:-1190.2623}  
Iteration 4:{space 3}log likelihood = {res:-1190.2613}  
Iteration 5:{space 3}log likelihood = {res:-1190.2613}  
{res}
{txt}Conditional (fixed-effects) logistic regression

{col 49}Number of obs{col 67}= {res}     8,786
{txt}{col 49}LR chi2({res}7{txt}){col 67}= {res}   4047.51
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1190.2613{txt}{col 49}Pseudo R2{col 67}= {res}    0.6297

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          VoteCandidate{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      z{col 57}   P>|z|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}ROMNEY {c |}{col 25}{res}{space 2} .1453236{col 37}{space 2} .0793106{col 48}{space 1}    1.83{col 57}{space 3}0.067{col 65}{space 4}-.0101222{col 78}{space 3} .3007694
{txt}{space 15}HUCKABEE {c |}{col 25}{res}{space 2} .4855769{col 37}{space 2} .0827803{col 48}{space 1}    5.87{col 57}{space 3}0.000{col 65}{space 4} .3233305{col 78}{space 3} .6478233
{txt}{space 10}NORMALIZED_FT {c |}{col 25}{res}{space 2} 1.853748{col 37}{space 2} .0962522{col 48}{space 1}   19.26{col 57}{space 3}0.000{col 65}{space 4} 1.665097{col 78}{space 3} 2.042398
{txt}{space 3}NORMALIZED_VIABILITY {c |}{col 25}{res}{space 2} 1.589671{col 37}{space 2} .3332203{col 48}{space 1}    4.77{col 57}{space 3}0.000{col 65}{space 4} .9365711{col 78}{space 3} 2.242771
{txt}NORMALIZED_ELECTABILITY {c |}{col 25}{res}{space 2} 3.054932{col 37}{space 2} .3652932{col 48}{space 1}    8.36{col 57}{space 3}0.000{col 65}{space 4}  2.33897{col 78}{space 3} 3.770894
{txt}{space 4}NORMALIZED_IDEOLOGY {c |}{col 25}{res}{space 2}-.4330676{col 37}{space 2} .0812631{col 48}{space 1}   -5.33{col 57}{space 3}0.000{col 65}{space 4}-.5923403{col 78}{space 3}-.2737949
{txt}{space 17}TRAITS {c |}{col 25}{res}{space 2} 7.817026{col 37}{space 2} .4983919{col 48}{space 1}   15.68{col 57}{space 3}0.000{col 65}{space 4} 6.840195{col 78}{space 3} 8.793856
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. cd "/Users/ryan/Google Drive/2020_2021/Thesis/Data/stata_regressions/2008"
{res}/Users/ryan/Google Drive/2020_2021/Thesis/Data/stata_regressions/2008
{txt}
{com}. outreg2 using 2008_phone_r.xls, replace
{txt}{browse `"2008_phone_r.xls"'}
{browse `"/Users/ryan/Google Drive/2020_2021/Thesis/Data/stata_regressions/2008"' :dir}{com} : {txt}{stata `"seeout using "2008_phone_r.txt""':seeout}

{com}. 
. clogit VoteCandidate ROMNEY HUCKABEE NORMALIZED_FT NORMALIZED_VIABILITY NORMALIZED_ELECTABILITY NORMALIZED_IDEOLOGY, group(ID)
{txt}note: 31 groups (40 obs) dropped because of all positive or
      all negative outcomes.
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -1427.413}  
Iteration 1:{space 3}log likelihood = {res: -1396.167}  
Iteration 2:{space 3}log likelihood = {res:-1352.2928}  
Iteration 3:{space 3}log likelihood = {res: -1352.212}  
Iteration 4:{space 3}log likelihood = {res: -1352.212}  
{res}
{txt}Conditional (fixed-effects) logistic regression

{col 49}Number of obs{col 67}= {res}     8,786
{txt}{col 49}LR chi2({res}6{txt}){col 67}= {res}   3723.60
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -1352.212{txt}{col 49}Pseudo R2{col 67}= {res}    0.5793

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          VoteCandidate{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      z{col 57}   P>|z|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 17}ROMNEY {c |}{col 25}{res}{space 2}-.2227275{col 37}{space 2} .0708656{col 48}{space 1}   -3.14{col 57}{space 3}0.002{col 65}{space 4}-.3616216{col 78}{space 3}-.0838334
{txt}{space 15}HUCKABEE {c |}{col 25}{res}{space 2} .0561746{col 37}{space 2} .0739618{col 48}{space 1}    0.76{col 57}{space 3}0.448{col 65}{space 4}-.0887879{col 78}{space 3}  .201137
{txt}{space 10}NORMALIZED_FT {c |}{col 25}{res}{space 2} 2.598575{col 37}{space 2} .0884841{col 48}{space 1}   29.37{col 57}{space 3}0.000{col 65}{space 4} 2.425149{col 78}{space 3} 2.772001
{txt}{space 3}NORMALIZED_VIABILITY {c |}{col 25}{res}{space 2} 2.584404{col 37}{space 2} .3162063{col 48}{space 1}    8.17{col 57}{space 3}0.000{col 65}{space 4} 1.964651{col 78}{space 3} 3.204157
{txt}NORMALIZED_ELECTABILITY {c |}{col 25}{res}{space 2} 3.802768{col 37}{space 2} .3493329{col 48}{space 1}   10.89{col 57}{space 3}0.000{col 65}{space 4} 3.118088{col 78}{space 3} 4.487448
{txt}{space 4}NORMALIZED_IDEOLOGY {c |}{col 25}{res}{space 2}-.5466185{col 37}{space 2}   .07595{col 48}{space 1}   -7.20{col 57}{space 3}0.000{col 65}{space 4}-.6954776{col 78}{space 3}-.3977593
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. outreg2 using 2008_phone_r.xls
{txt}{browse `"2008_phone_r.xls"'}
{browse `"/Users/ryan/Google Drive/2020_2021/Thesis/Data/stata_regressions/2008"' :dir}{com} : {txt}{stata `"seeout using "2008_phone_r.txt""':seeout}

{com}. 
{txt}end of do-file

{com}. exit
